## Terraform Plan Results

✅ Plan succeeded

<details>
<summary>Show Plan</summary>

```terraform

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place
-/+ destroy and then create replacement
 <= read (data resources)

Terraform will perform the following actions:

  # module.firestore.google_firebaserules_release.firestore must be replaced
-/+ resource "google_firebaserules_release" "firestore" {
      ~ create_time  = "2025-11-25T06:43:01.933143Z" -> (known after apply)
      ~ disabled     = false -> (known after apply)
      ~ id           = "projects/wedding-smile-catcher/releases/cloud.firestore" -> (known after apply)
        name         = "cloud.firestore"
      ~ ruleset_name = "projects/wedding-smile-catcher/rulesets/938f11cc-8ae3-40b5-a756-656ec5d992d2" -> "3c5b7fab-3ffc-4b00-89cf-e9342bca35d9" # forces replacement
      ~ update_time  = "2025-11-30T07:57:03.256364Z" -> (known after apply)
        # (1 unchanged attribute hidden)
    }

  # module.functions.data.archive_file.scoring_source will be read during apply
  # (config refers to values not yet known)
 <= data "archive_file" "scoring_source" {
      + excludes            = [
          + "*.pyc",
          + ".DS_Store",
          + ".env",
          + "__pycache__",
        ]
      + id                  = (known after apply)
      + output_base64sha256 = (known after apply)
      + output_base64sha512 = (known after apply)
      + output_md5          = (known after apply)
      + output_path         = (known after apply)
      + output_sha          = (known after apply)
      + output_sha256       = (known after apply)
      + output_sha512       = (known after apply)
      + output_size         = (known after apply)
      + source_dir          = "./../src/functions/scoring"
      + type                = "zip"
    }

  # module.functions.data.archive_file.webhook_source will be read during apply
  # (config refers to values not yet known)
 <= data "archive_file" "webhook_source" {
      + excludes            = [
          + "*.pyc",
          + ".DS_Store",
          + ".env",
          + "__pycache__",
        ]
      + id                  = (known after apply)
      + output_base64sha256 = (known after apply)
      + output_base64sha512 = (known after apply)
      + output_md5          = (known after apply)
      + output_path         = (known after apply)
      + output_sha          = (known after apply)
      + output_sha256       = (known after apply)
      + output_sha512       = (known after apply)
      + output_size         = (known after apply)
      + source_dir          = "./../src/functions/webhook"
      + type                = "zip"
    }

  # module.functions.google_cloudfunctions2_function.scoring will be updated in-place
  ~ resource "google_cloudfunctions2_function" "scoring" {
        id               = "projects/wedding-smile-catcher/locations/asia-northeast1/functions/scoring"
        name             = "scoring"
        # (10 unchanged attributes hidden)

      ~ build_config {
            # (6 unchanged attributes hidden)

          ~ source {
              ~ storage_source {
                  ~ object     = "functions/scoring-1d7a3566ff74c19923f91b0adb602023.zip" -> (known after apply)
                    # (2 unchanged attributes hidden)
                }
            }

            # (1 unchanged block hidden)
        }

      ~ service_config {
          ~ environment_variables            = {
              - "CURRENT_EVENT_ID" = "test" -> null
                # (3 unchanged elements hidden)
            }
            # (11 unchanged attributes hidden)

          ~ secret_environment_variables {
              ~ project_id = "548587922270" -> "wedding-smile-catcher"
                # (3 unchanged attributes hidden)
            }
        }
    }

  # module.functions.google_cloudfunctions2_function.webhook will be updated in-place
  ~ resource "google_cloudfunctions2_function" "webhook" {
        id               = "projects/wedding-smile-catcher/locations/asia-northeast1/functions/webhook"
        name             = "webhook"
        # (10 unchanged attributes hidden)

      ~ build_config {
            # (6 unchanged attributes hidden)

          ~ source {
              ~ storage_source {
                  ~ object     = "functions/webhook-7377254b69848d61c80ae9c1e2dc51c2.zip" -> (known after apply)
                    # (2 unchanged attributes hidden)
                }
            }

            # (1 unchanged block hidden)
        }

      ~ service_config {
          ~ environment_variables            = {
              - "CURRENT_EVENT_ID"     = "test" -> null
                # (4 unchanged elements hidden)
            }
            # (11 unchanged attributes hidden)

          ~ secret_environment_variables {
              ~ key        = "LINE_CHANNEL_ACCESS_TOKEN" -> "LINE_CHANNEL_SECRET"
              ~ project_id = "548587922270" -> "wedding-smile-catcher"
              ~ secret     = "line-channel-access-token" -> "line-channel-secret"
                # (1 unchanged attribute hidden)
            }
          ~ secret_environment_variables {
              ~ key        = "LINE_CHANNEL_SECRET" -> "LINE_CHANNEL_ACCESS_TOKEN"
              ~ project_id = "548587922270" -> "wedding-smile-catcher"
              ~ secret     = "line-channel-secret" -> "line-channel-access-token"
                # (1 unchanged attribute hidden)
            }
        }
    }

  # module.functions.google_storage_bucket_object.scoring_source must be replaced
-/+ resource "google_storage_bucket_object" "scoring_source" {
      + content          = (sensitive value)
      ~ content_type     = "application/zip" -> (known after apply)
      ~ crc32c           = "xysXVg==" -> (known after apply)
      ~ detect_md5hash   = "HXo1Zv90wZkj+RsK22AgIw==" -> "different hash"
      - event_based_hold = false -> null
      ~ generation       = 1764052982258330 -> (known after apply)
      ~ id               = "wedding-smile-images-wedding-smile-catcher-functions/scoring-1d7a3566ff74c19923f91b0adb602023.zip" -> (known after apply)
      + kms_key_name     = (known after apply)
      ~ md5hash          = "HXo1Zv90wZkj+RsK22AgIw==" -> (known after apply)
      ~ md5hexhash       = "1d7a3566ff74c19923f91b0adb602023" -> (known after apply)
      ~ media_link       = "https://storage.googleapis.com/download/storage/v1/b/wedding-smile-images-wedding-smile-catcher/o/functions%2Fscoring-1d7a3566ff74c19923f91b0adb602023.zip?generation=1764052982258330&alt=media" -> (known after apply)
      - metadata         = {} -> null
      ~ name             = "functions/scoring-1d7a3566ff74c19923f91b0adb602023.zip" # forces replacement -> (known after apply) # forces replacement
      ~ output_name      = "functions/scoring-1d7a3566ff74c19923f91b0adb602023.zip" -> (known after apply)
      ~ self_link        = "https://www.googleapis.com/storage/v1/b/wedding-smile-images-wedding-smile-catcher/o/functions%2Fscoring-1d7a3566ff74c19923f91b0adb602023.zip" -> (known after apply)
      ~ source           = "./.terraform/tmp/scoring-20251125064301.zip" # forces replacement -> (known after apply) # forces replacement
      ~ storage_class    = "STANDARD" -> (known after apply)
      - temporary_hold   = false -> null
        # (1 unchanged attribute hidden)
    }

  # module.functions.google_storage_bucket_object.webhook_source must be replaced
-/+ resource "google_storage_bucket_object" "webhook_source" {
      + content          = (sensitive value)
      ~ content_type     = "application/zip" -> (known after apply)
      ~ crc32c           = "8TXZFw==" -> (known after apply)
      ~ detect_md5hash   = "c3clS2mEjWHICunB4txRwg==" -> "different hash"
      - event_based_hold = false -> null
      ~ generation       = 1764052982065848 -> (known after apply)
      ~ id               = "wedding-smile-images-wedding-smile-catcher-functions/webhook-7377254b69848d61c80ae9c1e2dc51c2.zip" -> (known after apply)
      + kms_key_name     = (known after apply)
      ~ md5hash          = "c3clS2mEjWHICunB4txRwg==" -> (known after apply)
      ~ md5hexhash       = "7377254b69848d61c80ae9c1e2dc51c2" -> (known after apply)
      ~ media_link       = "https://storage.googleapis.com/download/storage/v1/b/wedding-smile-images-wedding-smile-catcher/o/functions%2Fwebhook-7377254b69848d61c80ae9c1e2dc51c2.zip?generation=1764052982065848&alt=media" -> (known after apply)
      - metadata         = {} -> null
      ~ name             = "functions/webhook-7377254b69848d61c80ae9c1e2dc51c2.zip" # forces replacement -> (known after apply) # forces replacement
      ~ output_name      = "functions/webhook-7377254b69848d61c80ae9c1e2dc51c2.zip" -> (known after apply)
      ~ self_link        = "https://www.googleapis.com/storage/v1/b/wedding-smile-images-wedding-smile-catcher/o/functions%2Fwebhook-7377254b69848d61c80ae9c1e2dc51c2.zip" -> (known after apply)
      ~ source           = "./.terraform/tmp/webhook-20251125064301.zip" # forces replacement -> (known after apply) # forces replacement
      ~ storage_class    = "STANDARD" -> (known after apply)
      - temporary_hold   = false -> null
        # (1 unchanged attribute hidden)
    }

Plan: 3 to add, 2 to change, 3 to destroy.
```

</details>

**Pusher**: @nakayamaryo0731
**Action**: pull_request
